Repository: oliverkroener/ok_ai_writer
Catalog: Resources/Private/Language/*.locallang_*_module.xlf
Languages: de

# mlang_labels_tablabel
source: AI Writer Configuration
de: AI Writer Konfiguration

# mlang_labels_tabdescr
source: Manage AI Writer API credentials per site.
de: AI Writer API-Zugangsdaten pro Website verwalten.

# module.title
source: AI Writer Configuration
de: AI Writer Konfiguration

# label.noPageSelected
source: Please select a page from the page tree.
de: Bitte eine Seite im Seitenbaum auswaehlen.

# label.noSiteFound
source: No TYPO3 site configuration found for this page. Please create a site configuration first.
de: Fuer diese Seite wurde keine TYPO3-Site-Konfiguration gefunden. Bitte erstellen Sie zuerst eine Site-Konfiguration.

# label.siteIdentifier
source: Site
de: Website

# label.siteRootPageId
source: Site Root Page ID
de: Stammseiten-ID

# label.fallbackActive
source: No per-site configuration found. Global Extension Configuration credentials are being used as fallback. Fill in the fields below to override with site-specific credentials.
de: Keine seitenspezifische Konfiguration gefunden. Die globalen Zugangsdaten aus der Extension-Konfiguration werden als Fallback verwendet. Fuellen Sie die Felder unten aus, um seitenspezifische Zugangsdaten zu verwenden.

# label.devMode
source: Developer Mode
de: Entwicklermodus

# label.devMode.description
source: When enabled, editors can override API credentials in their browser (localStorage). When disabled, only server-side credentials are used.
de: Wenn aktiviert, koennen Redakteure die API-Zugangsdaten im Browser (localStorage) ueberschreiben. Wenn deaktiviert, werden nur serverseitige Zugangsdaten verwendet.

# label.mode
source: API Mode
de: API-Modus

# label.mode.description
source: Select the AI provider: Azure OpenAI or OpenAI (ChatGPT).
de: AI-Anbieter auswaehlen: Azure OpenAI oder OpenAI (ChatGPT).

# label.apiUrl.description
source: The endpoint URL. Azure: https://<resource>.openai.azure.com/openai/deployments/<model>/chat/completions?api-version=2024-02-01 | OpenAI: https://api.openai.com/v1/chat/completions
de: Die Endpunkt-URL. Azure: https://<resource>.openai.azure.com/openai/deployments/<model>/chat/completions?api-version=2024-02-01 | OpenAI: https://api.openai.com/v1/chat/completions

# label.apiKey
source: API Key
de: API-Schluessel

# label.apiKey.description
source: Your API key for the selected provider. Stored encrypted in the database.
de: Ihr API-Schluessel fuer den ausgewaehlten Anbieter. Wird verschluesselt in der Datenbank gespeichert.

# label.apiKey.existing
source: An API key is stored (encrypted). Leave empty to keep it, or enter a new value to replace it.
de: Ein API-Schluessel ist gespeichert (verschluesselt). Leer lassen um ihn zu behalten, oder einen neuen Wert eingeben um ihn zu ersetzen.

# label.model
source: Model
de: Modell

# label.model.description
source: The model to use (e.g. gpt-4o, gpt-4, gpt-3.5-turbo). In Azure mode, the model is part of the URL.
de: Das zu verwendende Modell (z.B. gpt-4o, gpt-4, gpt-3.5-turbo). Im Azure-Modus ist das Modell Teil der URL.

# warning.encryptionKeyMissing.title
source: Encryption Key Missing
de: Verschluesselungsschluessel fehlt

# warning.encryptionKeyMissing.body
source: The TYPO3 encryption key ($GLOBALS['TYPO3_CONF_VARS']['SYS']['encryptionKey']) is not set. The API key cannot be encrypted without it. Please configure the encryption key in the Install Tool before saving credentials.
de: Der TYPO3-Verschluesselungsschluessel ($GLOBALS['TYPO3_CONF_VARS']['SYS']['encryptionKey']) ist nicht gesetzt. Der API-Schluessel kann ohne ihn nicht verschluesselt werden. Bitte konfigurieren Sie den Verschluesselungsschluessel im Install Tool bevor Sie Zugangsdaten speichern.

# message.saved.title
source: Configuration Saved
de: Konfiguration gespeichert

# message.saved.body
source: AI Writer configuration has been saved successfully.
de: Die AI Writer Konfiguration wurde erfolgreich gespeichert.
